<a href="https://colab.research.google.com/github/K-3-LT/BA780/blob/main/Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment 2

## Data

This is a historical dataset on the modern Olympic Games, including all the Games from Athens 1896 to Rio 2016. The data was taken from Kaggle. The `athlete_events` Dataset contains $271,116$ rows and $15$ columns.

**Source:**

Griffin, R, H (2018) 120 years of Olympic history: athletes and results, athlete_events, Found at: https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results#athlete_events.csv

**ATTRIBUTES:**

**athlete_events.csv**

| Column Name | Data Type | Description/Notes |
|:----:|:----:|:----|
| ID |  integer | Unique number for each athlete |
| Name | string | Athleteâ€™s name |
| Sex | string | M or F |
| Age | integer |  |
| Height | integer | In centimeters |
| Weight | integer | In kilograms |
| Team | string | Team name |
| NOC | string | National Olympic Committee, 3 letter code (Matches with `NOC` from noc_regions.csv) |
| Games | string | Year and season |
| Year | integer |  |
| Season | string | Summer or Winter |
| City | string | Host city |
| Sport | string |  |
| Event | string |  |
| Medal | string | Gold, Silver, Bronze, or NA |

Download athlete_events.csv from the link above and load it into a DataFrame called `athlete_events`:

In [2]:
# Your answer goes here
import pandas as pd

url = 'https://raw.githubusercontent.com/soltaniehha/Business-Analytics/master/data/athlete_events.csv'
athlete_events = pd.read_csv(url)

Use `info()` method on this DataFrame to get a sense of the data:

In [3]:
# Your answer goes here
athlete_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

## Question 1
Clearly not every athlete receives a medal in the olympics. How many records have a non-null value for `Medal` field? In other words, how many medals were given according to this dataset?

In [4]:
# Your answer goes here
len(athlete_events['Medal'].dropna())

39783

Use the `head()` method to inspect the first few rows of the data:

In [5]:
# Your answer goes here
athlete_events.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

## Question 2 & 3

What is the earliest and latest Olympic that is captured in this dataset?

In [6]:
# Your answer goes here
athlete_events['Year'].min()

1896

In [7]:
# Your answer goes here
athlete_events['Year'].max()

2016

## Question 4 & 5

Is the following statement True or False?

> Average age of female athletes who attended the Olympic games after 1990 has risen compared to the era before then.

In [8]:
# Your answer goes here
female = athlete_events[athlete_events['Sex'] == 'F']
b90 = female[female['Year'] <= 1990]
a90 = female[female['Year'] > 1990]

print(b90['Age'].mean() < a90['Age'].mean())

True

In [9]:
# Your answer goes here

## Question 6 & 7

How many Gold medals were given to men from 1970 to 2000 (including both years)?

In [10]:
len(athlete_events)

271116

In [11]:
# Your answer goes here
male = athlete_events[athlete_events['Sex'] == 'M']
f70to00 = male[(male['Year'] >= 1970) & (male['Year'] <= 2000)]
gold = f70to00[f70to00['Medal'] == 'Gold']
len(gold)

3207

## Question 8 & 9

How many athletes attended the Olympic games in 1968?

Hint: You can use the method `.unique()` on any pandas Series to get the unique values. Any column subset of a DataFrame returns a Series object.

In [12]:
# Your answer goes here
y1968 = athlete_events[athlete_events['Year'] == 1968]
len(y1968['ID'].unique())

6717

## Question 10 & 11

Who won the event "Swimming Men's 100 metres Breaststroke" in 2004? Note that "metres" has a British spelling!

In [17]:
# Your answer goes here
athlete_events[(athlete_events['Event'] == "Swimming Men's 100 metres Breaststroke") & (athlete_events['Year'] == 2004) & (athlete_events['Medal'] == 'Gold')].Name

120309    Kosuke Kitajima
Name: Name, dtype: object

## Question 12 & 13
In the Year 2004, which National Olympic Committee (NOC) had the fourth-highest medal tally?

In [14]:
# Your answer goes here
mt = athlete_events[athlete_events['Year'] == 2004].groupby(['NOC'])['Medal'].count()
mt.sort_values(ascending=False)

NOC
USA    263
RUS    189
AUS    157
GER    149
ITA    104
      ...
IRL      0
IRQ      0
ISL      0
ISV      0
KIR      0
Name: Medal, Length: 201, dtype: int64

## Question 14 & 15
What was the average age of male athletes for the year with the third-highest male participation of all years? And what year was that?

(Assume that if an athlete competes in 2 or more events in a given year, that counts as 2 or more participations.)

In [15]:
athlete_events.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [16]:
# Your answer goes here
male_part = athlete_events[athlete_events['Sex'] == 'M'].groupby(['Year'])['Event'].count()
male_part.sort_values(ascending=False)
# the third-highest year is 1972
s = athlete_events[(athlete_events['Year'] == 1972) & (athlete_events['Sex'] == 'M')]
s['Age'].mean()

25.31050869424344